12/data/attachments/5b8c29e26a6e443.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bc07b27b-98ea-4754-abc5-99e04a57ce90</nif:username>
            <nif:friendToBeAdded>Jackie_natural_Friend_72728_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>